schrab/ESP32S3Marauder/esp32s3_marauder/MenuFunctions.cpp
    if (battery_analog_last != battery_analog) {
      battery_analog_last = battery_analog;
      MenuFunctions::battery2();
    }
  }
}
void MenuFunctions::battery2(bool initial)
{
  uint16_t the_color;
  if ( digitalRead(CHARGING_PIN) == 1) the_color = TFT_BLUE;
  else if (battery_analog < 20) the_color = TFT_RED;
  else if (battery_analog < 40)  the_color = TFT_YELLOW;
  else the_color = TFT_GREEN;

  display_obj.tft.setTextColor(the_color, STATUSBAR_COLOR);
  display_obj.tft.fillRect(186, 0, 50, STATUS_BAR_WIDTH, STATUSBAR_COLOR);
  display_obj.tft.drawXBitmap(186,
                              0,
                              menu_icons[STATUS_BAT],
                              16,
                              16,
                              STATUSBAR_COLOR,
                              the_color);
  display_obj.tft.drawString((String) battery_analog + "%", 204, 0, 2);
}
#else
void MenuFunctions::battery(bool initial)
{
  #ifdef HAS_BATTERY
    uint16_t the_color;
    if (battery_obj.i2c_supported)
    {
      // Could use int compare maybe idk
      if (((String)battery_obj.battery_level != "25") && ((String)battery_obj.battery_level != "0"))
        the_color = TFT_GREEN;
      else
        the_color = TFT_RED;

      if ((battery_obj.battery_level != battery_obj.old_level) || (initial)) {
        battery_obj.old_level = battery_obj.battery_level;
        display_obj.tft.fillRect(204, 0, SCREEN_WIDTH, STATUS_BAR_WIDTH, STATUSBAR_COLOR);
        display_obj.tft.setCursor(0, 1);
        display_obj.tft.drawXBitmap(186,
                                    0,
                                    menu_icons[STATUS_BAT],
                                    16,
                                    16,
                                    STATUSBAR_COLOR,
                                    the_color);
        display_obj.tft.drawString((String)battery_obj.battery_level + "%", 204, 0, 2);
      }
    }
  #endif
}
void MenuFunctions::battery2(bool initial)
{
  MenuFunctions::battery(initial);
}
#endif

void MenuFunctions::updateStatusBar()
{
  display_obj.tft.setTextSize(1);

  bool status_changed = false;
  
  #if defined(MARAUDER_MINI) || defined(MARAUDER_M5STICKC) || defined(ESP32_S3_MINI)
    display_obj.tft.setFreeFont(NULL);
  #endif
  
  uint16_t the_color; 
  
  
  // GPS Stuff
  #ifdef HAS_GPS
  if (this->old_gps_sat_count != gps_obj.getNumSats()) {
    this->old_gps_sat_count = gps_obj.getNumSats();
    display_obj.tft.fillRect(0, 0, SCREEN_WIDTH / 8, STATUS_BAR_WIDTH, STATUSBAR_COLOR);
    status_changed = true;
  }

    if (gps_obj.getGpsModuleStatus()) {
      if (gps_obj.getFixStatus()) {
          // Get the datetime string from gps_obj.getDatetime()
          String datetimeStr = gps_obj.getDatetime();
          // Parse the datetime string to extract individual values
          int year, month, day, hour, minute, second;
          sscanf(datetimeStr.c_str(), "%d-%d-%d %d:%d:%d", &year, &month, &day, &hour, &minute, &second);
          // Set the RTC clock with the extracted values
          rtc.setTime(second, minute, hour, day, month, year);
          // rtc.setTime(seconds, minutes, hours, day of the month, month, year);
          // Example: rtc.setTime(0, 20, 16, 27, 6, 2024); for 27th Jun 2024 4:20:00
        the_color = TFT_GREEN;
      } else {
        the_color = TFT_RED;
      }
      #ifdef HAS_SCREEN
        display_obj.tft.setTextWrap(false);
        display_obj.tft.setTextColor(the_color, STATUSBAR_COLOR);
        display_obj.tft.drawString("GPS " + gps_obj.getNumSatsString(), 0, 1, 1);
      #endif
      
    }
  #endif

  display_obj.tft.setTextColor(TFT_WHITE, STATUSBAR_COLOR);

  // WiFi Channel Stuff Update
  if ((wifi_scan_obj.set_channel != wifi_scan_obj.old_channel) || (status_changed)) {
    wifi_scan_obj.old_channel = wifi_scan_obj.set_channel;
    #if defined(MARAUDER_MINI) || defined(MARAUDER_M5STICKC) || defined(ESP32_S3_MINI)
      display_obj.tft.fillRect(SCREEN_WIDTH/8, 0, SCREEN_WIDTH / 8, STATUS_BAR_WIDTH, STATUSBAR_COLOR); // STATUSBAR_COLOR
    #else
      display_obj.tft.fillRect(50, 0, SCREEN_WIDTH * 0.21, STATUS_BAR_WIDTH, STATUSBAR_COLOR);
    #endif
  

    #if defined(MARAUDER_MINI) || defined(MARAUDER_M5STICKC) || defined(ESP32_S3_MINI)
      display_obj.tft.setTextWrap(false);
      display_obj.tft.drawString("CH: " + (String)wifi_scan_obj.set_channel, SCREEN_WIDTH/8, 1, 1);
    #endif
  }

  // RAM Stuff Update
  wifi_scan_obj.freeRAM();
  if ((wifi_scan_obj.free_ram != wifi_scan_obj.old_free_ram) || (status_changed)) {
    wifi_scan_obj.old_free_ram = wifi_scan_obj.free_ram;
    display_obj.tft.fillRect(SCREEN_WIDTH/1.3, 0, 40, STATUS_BAR_WIDTH, STATUSBAR_COLOR);
    #ifdef HAS_ILI9341
      display_obj.tft.drawString((String)wifi_scan_obj.free_ram + " KB", 100, 0, 2);
    #endif
    
    #if defined(ESP32_S3_MINI) || defined(MARAUDER_MINI) || defined(MARAUDER_M5STICKC) || defined(MARAUDER_REV_FEATHER)
      display_obj.tft.setTextWrap(false);
      display_obj.tft.drawString((String)wifi_scan_obj.free_ram + " Kb", SCREEN_WIDTH/1.3, 1, 1);
    #endif
  }

  // RTC Stuff
  rtc.offset = 25200;
  String date_time = rtc.getTime("%e, %b %R");
  if ((date_time != old_date_time)) {
    old_date_time = date_time;
    display_obj.tft.fillRect(SCREEN_WIDTH/2.4, 0, 60, STATUS_BAR_WIDTH, STATUSBAR_COLOR);
    #if defined(ESP32_S3_MINI) || defined(MARAUDER_MINI) || defined(MARAUDER_M5STICKC) || defined(MARAUDER_REV_FEATHER)
      display_obj.tft.drawString((String)date_time, SCREEN_WIDTH/2.4, 1, 1);
    #endif
  }
 
  // Draw battery info
  //MenuFunctions::battery(false);
  #ifdef HAS_BATTERY
  display_obj.tft.fillRect(190, 0, SCREEN_WIDTH, STATUS_BAR_WIDTH, STATUSBAR_COLOR);
  #endif
 


  // Draw SD info
  #ifdef HAS_SD
    if (sd_obj.supported)
      the_color = TFT_GREEN;
    else
      the_color = TFT_RED;
  #endif

  #if defined(MARAUDER_MINI) || defined(MARAUDER_M5STICKC) || defined(ESP32_S3_MINI)
    display_obj.tft.setTextWrap(false);
    display_obj.tft.setTextColor(the_color, STATUSBAR_COLOR);
    display_obj.tft.drawString("SD", SCREEN_WIDTH - 12, 1, 1);
  #endif
}

