schrab/ESP32S3Marauder/esp32s3_marauder/MenuFunctions.cpp
              this->htmlMenu.list->set(0, MenuNode{evil_portal_obj.html_files->get(evil_portal_obj.selected_html_index), false, TFT_CYAN, 0, NULL, true, NULL});
              this->buildButtons(&htmlMenu);
              this->displayCurrentMenu();
            }
            // #ifndef MARAUDER_M5STICKC 
            #endif
            #ifdef HAS_U
              if (u_btn.justPressed()) {
                if (evil_portal_obj.selected_html_index < evil_portal_obj.html_files->size() - 1)
                  evil_portal_obj.selected_html_index++;
                else
                  evil_portal_obj.selected_html_index = 0;

                this->htmlMenu.list->set(0, MenuNode{evil_portal_obj.html_files->get(evil_portal_obj.selected_html_index), false, TFT_CYAN, 0, NULL, true, NULL});
                this->buildButtons(&htmlMenu, 0, evil_portal_obj.html_files->get(evil_portal_obj.selected_html_index));
                this->displayCurrentMenu();
              }
            #endif
            if (c_btn.justPressed()) {
              if (evil_portal_obj.html_files->get(evil_portal_obj.selected_html_index) != "Back") {
                evil_portal_obj.target_html_name = evil_portal_obj.html_files->get(evil_portal_obj.selected_html_index);
                Serial.println("Set Evil Portal HTML as " + evil_portal_obj.target_html_name);
                evil_portal_obj.using_serial_html = false;
              }
              this->changeMenu(htmlMenu.parentMenu);
              break;
            }
          }
        #endif
      #endif
    });

    #if (!defined(HAS_ILI9341) && defined(HAS_BUTTONS))
      miniKbMenu.parentMenu = &wifiGeneralMenu;
      this->addNodes(&miniKbMenu, "a", TFT_CYAN, NULL, 0, [this]() {
        this->changeMenu(miniKbMenu.parentMenu);
      });
    #endif

    htmlMenu.parentMenu = &wifiGeneralMenu;
    this->addNodes(&htmlMenu, text09, TFT_RED, NULL, 0, [this]() {
      this->changeMenu(htmlMenu.parentMenu);
    });

    // Select APs on Mini
    this->addNodes(&wifiGeneralMenu, text_table1[56], TFT_NAVY, NULL, KEYBOARD_ICO, [this](){
      wifiAPMenu.list->clear();
        this->addNodes(&wifiAPMenu, text09, TFT_LIGHTGREY, NULL, 0, [this]() {
        this->changeMenu(wifiAPMenu.parentMenu);
      });
      int menu_limit;
      if (access_points->size() <= BUTTON_ARRAY_LEN)
        menu_limit = access_points->size();
      else
        menu_limit = BUTTON_ARRAY_LEN;
      for (int i = 0; i < menu_limit - 1; i++) {
        this->addNodes(&wifiAPMenu, access_points->get(i).essid, TFT_CYAN, NULL, KEYBOARD_ICO, [this, i](){
        AccessPoint new_ap = access_points->get(i);
        new_ap.selected = !access_points->get(i).selected;

        // Change selection status of menu node
        MenuNode new_node = current_menu->list->get(i + 1);
        new_node.selected = !current_menu->list->get(i + 1).selected;
        current_menu->list->set(i + 1, new_node);

        // Change selection status of button key
        // if (new_ap.selected) {
        //   this->buttonSelected(i + 1);
        // } else {
        //   this->buttonNotSelected(i + 1);
        // }
        access_points->set(i, new_ap);
        }, access_points->get(i).selected);
      }
      this->changeMenu(&wifiAPMenu);
    });

    wifiAPMenu.parentMenu = &wifiGeneralMenu;
    this->addNodes(&wifiAPMenu, text09, TFT_LIGHTGREY, NULL, 0, [this]() {
      this->changeMenu(wifiAPMenu.parentMenu);
    });

       // Select Stations on Mini v2
    this->addNodes(&wifiGeneralMenu, "Select Stations", TFT_CYAN, NULL, KEYBOARD_ICO, [this](){
      wifiAPMenu.list->clear();
        this->addNodes(&wifiAPMenu, text09, TFT_LIGHTGREY, NULL, 0, [this]() {
        this->changeMenu(wifiAPMenu.parentMenu);
      });

      int menu_limit;

      if (access_points->size() <= BUTTON_ARRAY_LEN)
        menu_limit = access_points->size();
      else
        menu_limit = BUTTON_ARRAY_LEN;

      for (int i = 0; i < menu_limit - 1; i++) {
        wifiStationMenu.list->clear();
        this->addNodes(&wifiAPMenu, access_points->get(i).essid, TFT_CYAN, NULL, KEYBOARD_ICO, [this, i](){

          wifiStationMenu.list->clear();

          // Add back button to the APs
          this->addNodes(&wifiStationMenu, text09, TFT_LIGHTGREY, NULL, 0, [this]() {
            this->changeMenu(wifiStationMenu.parentMenu);
          });

          // Add the AP's stations to the specific AP menu
          for (int x = 0; x < access_points->get(i).stations->size(); x++) {
            int cur_ap_sta = access_points->get(i).stations->get(x);

            this->addNodes(&wifiStationMenu, wifi_scan_obj.macToString(stations->get(cur_ap_sta)), TFT_CYAN, NULL, KEYBOARD_ICO, [this, i, cur_ap_sta, x](){
            Station new_sta = stations->get(cur_ap_sta);
            new_sta.selected = !stations->get(cur_ap_sta).selected;

            // Change selection status of menu node
            MenuNode new_node = current_menu->list->get(x + 1);
            new_node.selected = !current_menu->list->get(x + 1).selected;
            current_menu->list->set(x + 1, new_node);

            // Change selection status of button key
            //if (new_sta.selected) {
            //  this->buttonSelected(i + 1);
            //} else {
            //  this->buttonNotSelected(i + 1);
            //}

            stations->set(cur_ap_sta, new_sta);
            }, stations->get(cur_ap_sta).selected);
          }

          // Final change menu to the menu of Stations
          this->changeMenu(&wifiStationMenu);

        }, false);
      }
      this->changeMenu(&wifiAPMenu);
    });

    wifiStationMenu.parentMenu = &wifiAPMenu;
    this->addNodes(&wifiStationMenu, text09, TFT_LIGHTGREY, NULL, 0, [this]() {
      this->changeMenu(wifiStationMenu.parentMenu);
    });  
  #endif

  // Build generate ssids menu
  generateSSIDsMenu.parentMenu = &wifiGeneralMenu;
  this->addNodes(&generateSSIDsMenu, text09, TFT_LIGHTGREY, NULL, 0, [this]() {
    this->changeMenu(generateSSIDsMenu.parentMenu);
  });

  // Build clear ssids menu
  clearSSIDsMenu.parentMenu = &wifiGeneralMenu;
  this->addNodes(&clearSSIDsMenu, text09, TFT_LIGHTGREY, NULL, 0, [this]() {
    this->changeMenu(clearSSIDsMenu.parentMenu);
  });
  clearAPsMenu.parentMenu = &wifiGeneralMenu;
  this->addNodes(&clearAPsMenu, text09, TFT_LIGHTGREY, NULL, 0, [this]() {
    this->changeMenu(clearAPsMenu.parentMenu);
  });

  saveSSIDsMenu.parentMenu = &saveFileMenu;
  this->addNodes(&saveSSIDsMenu, text09, TFT_LIGHTGREY, NULL, 0, [this]() {
    this->changeMenu(saveSSIDsMenu.parentMenu);
  });

  loadSSIDsMenu.parentMenu = &saveFileMenu;
  this->addNodes(&loadSSIDsMenu, text09, TFT_LIGHTGREY, NULL, 0, [this]() {
    this->changeMenu(loadSSIDsMenu.parentMenu);
  });

