schrab/ESP32S3Marauder/esp32s3_marauder/MenuFunctions.cpp
    bool pressed = true;

    wifi_scan_obj.current_mini_kb_ssid = "";

    if (c_btn.isHeld()) {
      while (!c_btn.justReleased())
        delay(1);
    }

    int str_len = wifi_scan_obj.alfa.length() + 1; 

    char char_array[str_len];

    wifi_scan_obj.alfa.toCharArray(char_array, str_len);

    // Button loop until hold center button
    #ifdef HAS_BUTTONS
      #if !(defined(MARAUDER_V6) || defined(MARAUDER_V6_1))
        while(true) {
          // Cycle char previous
          #ifdef HAS_L
            if (l_btn.justPressed()) {
              pressed = true;
              if (this->mini_kb_index > 0)
                this->mini_kb_index--;
              else
                this->mini_kb_index = str_len - 2;

              targetMenu->list->set(0, MenuNode{String(char_array[this->mini_kb_index]).c_str(), false, TFT_CYAN, 0, NULL, true, NULL});
              this->buildButtons(targetMenu);
              while (!l_btn.justReleased())
                delay(1);
            }
          #endif

          // Cycle char next
          #ifdef HAS_R
            if (r_btn.justPressed()) {
              pressed = true;
              if (this->mini_kb_index < str_len - 2)
                this->mini_kb_index++;
              else
                this->mini_kb_index = 0;

              targetMenu->list->set(0, MenuNode{String(char_array[this->mini_kb_index]).c_str(), false, TFT_CYAN, 0, NULL, true, NULL});
              this->buildButtons(targetMenu, 0, String(char_array[this->mini_kb_index]).c_str());
              while (!r_btn.justReleased())
                delay(1);
            }
          #endif

          //// 5-WAY SWITCH STUFF
          // Add character
          #if (defined(HAS_D) && defined(HAS_R))
            if (d_btn.justPressed()) {
              pressed = true;
              wifi_scan_obj.current_mini_kb_ssid.concat(String(char_array[this->mini_kb_index]).c_str());
              while (!d_btn.justReleased())
                delay(1);
            }
          #endif

          // Remove character
          #if (defined(HAS_U) && defined(HAS_L))
            if (u_btn.justPressed()) {
              pressed = true;
              wifi_scan_obj.current_mini_kb_ssid.remove(wifi_scan_obj.current_mini_kb_ssid.length() - 1);
              while (!u_btn.justReleased())
                delay(1);
            }
          #endif

          //// PARTIAL SWITCH STUFF
          // Advance char or add char
          #if (defined(HAS_D) && !defined(HAS_R))
            if (d_btn.justPressed()) {
              bool was_held = false;
              pressed = true;
              while(!d_btn.justReleased()) {
                d_btn.justPressed();

                // Add letter to string
                if (d_btn.isHeld()) {
                  wifi_scan_obj.current_mini_kb_ssid.concat(String(char_array[this->mini_kb_index]).c_str());
                  was_held = true;
                  break;
                }
              }
              if (!was_held) {
                if (this->mini_kb_index < str_len - 2)
                  this->mini_kb_index++;
                else
                  this->mini_kb_index = 0;

                targetMenu->list->set(0, MenuNode{String(char_array[this->mini_kb_index]).c_str(), false, TFT_CYAN, 0, NULL, true, NULL});
                this->buildButtons(targetMenu, 0, String(char_array[this->mini_kb_index]).c_str());
              }
            }
          #endif

          // Prev char or remove char
          #if (defined(HAS_U) && !defined(HAS_L))
            if (u_btn.justPressed()) {
              bool was_held = false;
              pressed = true;
              while(!u_btn.justReleased()) {
                u_btn.justPressed();

                // Remove letter from string
                if (u_btn.isHeld()) {
                  wifi_scan_obj.current_mini_kb_ssid.remove(wifi_scan_obj.current_mini_kb_ssid.length() - 1);
                  was_held = true;
                  break;
                }
              }
              if (!was_held) {
                if (this->mini_kb_index > 0)
                  this->mini_kb_index--;
                else
                  this->mini_kb_index = str_len - 2;

                targetMenu->list->set(0, MenuNode{String(char_array[this->mini_kb_index]).c_str(), false, TFT_CYAN, 0, NULL, true, NULL});
                this->buildButtons(targetMenu);
              }
            }
          #endif

          // Add SSID
          #ifdef HAS_C
            if (c_btn.justPressed()) {
              while (!c_btn.justReleased()) {
                c_btn.justPressed(); // Need to continue updating button hold status. My shitty library.

                // Exit
                if (c_btn.isHeld()) {
                  this->changeMenu(targetMenu->parentMenu);
                  return;
                }
                delay(1);
              }
              // If we have a string, add it to list of SSIDs
              if (wifi_scan_obj.current_mini_kb_ssid != "") {
                pressed = true;
                ssid s = {wifi_scan_obj.current_mini_kb_ssid, random(1, 12), {random(256), random(256), random(256), random(256), random(256), random(256)}, false};
                ssids->unshift(s);
                wifi_scan_obj.current_mini_kb_ssid = "";
              }
            }
          #endif

          // Display info on screen
          if (pressed) {
            this->displayCurrentMenu();
            display_obj.tft.setTextWrap(false);
            display_obj.tft.fillRect(0, SCREEN_HEIGHT / 3, SCREEN_WIDTH, STATUS_BAR_WIDTH, TFT_BLACK);
            display_obj.tft.fillRect(0, SCREEN_HEIGHT / 3 + TEXT_HEIGHT * 2, SCREEN_WIDTH, STATUS_BAR_WIDTH, TFT_BLACK);
            display_obj.tft.setCursor(0, SCREEN_HEIGHT / 3);
            display_obj.tft.setTextColor(TFT_CYAN, TFT_BLACK);
            display_obj.tft.println(wifi_scan_obj.current_mini_kb_ssid + "\n");
            display_obj.tft.setTextColor(TFT_GREEN, TFT_BLACK);

            display_obj.tft.println(ssids->get(0).essid);

            display_obj.tft.setTextColor(TFT_ORANGE, TFT_BLACK);
            display_obj.tft.println("U/D - Rem/Add Char");
            display_obj.tft.println("L/R - Prev/Nxt Char");
            display_obj.tft.println("C - Save");
            display_obj.tft.println("C(Hold) - Exit");
            pressed = false;
          }
        }
      #endif
    #endif
  }
#endif

// Function to change menu
void MenuFunctions::changeMenu(Menu * menu)
{
  display_obj.initScrollValues();
  display_obj.setupScrollArea(TOP_FIXED_AREA, BOT_FIXED_AREA);
  display_obj.tft.init();
  current_menu = menu;

  buildButtons(menu);

