schrab/ESP32S3Marauder/esp32s3_marauder/MenuFunctions.cpp
  displayCurrentMenu();
}

// Function to show all MenuNodes in a Menu
void MenuFunctions::showMenuList(Menu * menu, int layer)
{
  // Iterate through all of the menu nodes in the menu
  for (uint8_t i = 0; i < menu->list->size(); i++)
  {
    // Depending on layer, indent
    for (uint8_t x = 0; x < layer * 4; x++)
      Serial.print(" ");
    Serial.print("Node: ");
    Serial.println(menu->list->get(i).name);
  }
  Serial.println();
}


// Function to add MenuNodes to a menu
void MenuFunctions::addNodes(Menu * menu, String name, uint16_t color, Menu * child, int place, std::function<void()> callable, bool selected, String command)
{
  TFT_eSPI_Button new_button;
  menu->list->add(MenuNode{name, false, color, place, &new_button, selected, callable});
  //menu->list->add(MenuNode{name, false, color, place, selected, callable});
}

void MenuFunctions::buildButtons(Menu * menu, int starting_index, String button_name)
{
  if (menu->list != NULL)
  {
    this->menu_start_index = starting_index;
    for (uint8_t i = 0; i < menu->list->size(); i++)
    {
      TFT_eSPI_Button new_button;
      char buf[menu->list->get(starting_index + i).name.length() + 1] = {};
      if (button_name != "")
        menu->list->get(starting_index + i).name.toCharArray(buf, menu->list->get(starting_index + i).name.length() + 1);
      else
        button_name.toCharArray(buf, button_name.length() + 1);
      display_obj.key[i].initButton(&display_obj.tft,
                                    KEY_X + 0 * (KEY_W + KEY_SPACING_X),
                                    KEY_Y + i * (KEY_H + KEY_SPACING_Y), // x, y, w, h, outline, fill, text
                                    KEY_W,
                                    KEY_H,
                                    TFT_BLACK, // Outline
                                    TFT_BLACK, // Fill
                                    menu->list->get(starting_index + i).color, // Text
                                    buf,
                                    KEY_TEXTSIZE);

      display_obj.key[i].setLabelDatum(BUTTON_PADDING - (KEY_W / 2), 4, ML_DATUM);
    }
  }
}

void MenuFunctions::displayCurrentMenu(uint8_t start_index)
{
  //Serial.println(F("Displaying current menu..."));
  display_obj.clearScreen();
  display_obj.updateBanner(current_menu->name);
  display_obj.tft.setTextColor(TFT_LIGHTGREY, TFT_DARKGREY);
  this->drawStatusBar();

  if (current_menu->list != NULL)
  {
    #ifdef HAS_ILI9341
      display_obj.tft.setFreeFont(NULL);
    #endif

    #if defined(MARAUDER_MINI) || defined(MARAUDER_M5STICKC) || defined(ESP32_S3_MINI)
      display_obj.tft.setFreeFont(NULL);
      display_obj.tft.setTextSize(1);
    #endif
    for (uint8_t i = start_index; i < current_menu->list->size(); i++)
    {
      #ifdef HAS_ILI9341
        if (!current_menu->list->get(i).selected)
          display_obj.key[i].drawButton(false, current_menu->list->get(i).name);
        else
          display_obj.key[i].drawButton(true, current_menu->list->get(i).name);
        
        if (current_menu->list->get(i).name != text09)
          display_obj.tft.drawXBitmap(0,
                                      KEY_Y + i * (KEY_H + KEY_SPACING_Y) - (ICON_H / 2),
                                      menu_icons[current_menu->list->get(i).icon],
                                      ICON_W,
                                      ICON_H,
                                      TFT_BLACK,
                                      current_menu->list->get(i).color);

      #endif

      #if defined(MARAUDER_MINI) || defined(MARAUDER_M5STICKC) || defined(ESP32_S3_MINI)
        if ((current_menu->selected == i) || (current_menu->list->get(i).selected)) {
          display_obj.key[i - start_index].drawButton(true, current_menu->list->get(i).name);
        }
        else
        { 
          display_obj.key[i - start_index].drawButton(false, current_menu->list->get(i).name);
        }
      #endif
    }
    display_obj.tft.setFreeFont(NULL);
  }
else
  {
    Serial.println("Current list is null");
  }
}

#endif